Revit 2027 API
AlignmentStationLabel.IsRecommendedTypeForSet Method
 Checks if the element type is recommended for alignment labels in sets.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsRecommendedTypeForSet(
	Element type
)
Public Shared Function IsRecommendedTypeForSet (
	type As Element
) As Boolean
public:
static bool IsRecommendedTypeForSet(
	Element^ type
)
static member IsRecommendedTypeForSet :
        type : Element -> bool
Parameters
type Element
The type element to check.
Return Value
Boolean
Remarks
 Can be used for finding types to be set to TypeId when creating alignment label sets with CreateSet(Alignment, View, AlignmentStationLabelSetOptions).
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace